app/views/users/show.html.erb


<% @user.trails.order("created_at asc").each do |trail| %>
---
SELECT "trails".* FROM "trails" WHERE "trails"."user_id" = ? ORDER BY created_at asc  [["user_id", 1]]

        <p class="card-1">Difficulty:&nbsp;&nbsp;&nbsp;<%= trail.difficulty %> / 5</p><br><br>
        <% if current_user.trails.include?(trail) %>
---
SELECT  1 AS one FROM "trails" WHERE "trails"."user_id" = ? AND "trails"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]