app/views/trails/_form.html.erb

SELECT "countries".* FROM "countries" ORDER BY name ASC
---
        <%= f.label "Country:" %>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
        <%= f.collection_select(:country_id, Country.all.order('name ASC'), :id, :name ) %><br><br>