app/views/trails/show.html.erb

    <p class="item1">Difficulty:&nbsp;&nbsp;&nbsp;<%= @trail.difficulty %> / 5<p/>
    <div id="trail-links"><% if current_user.trails.include?(@trail) %>
---
SELECT  1 AS one FROM "trails" WHERE "trails"."user_id" = ? AND "trails"."id" = ? LIMIT ?  [["user_id", 1], ["id", 12], ["LIMIT", 1]]