app/views/countries/show.html.erb


<% @country.trails.each do |t| %>
---
SELECT "trails".* FROM "trails" WHERE "trails"."country_id" = ?  [["country_id", 210]]