app/controllers/comments_controller.rb

  def create
    @comment = Comment.create(content: params[:comment][:content], user_id: params[:user_id], trail_id: params[:trail_id], comment_owner: current_user.name)
---
INSERT INTO "comments" ("content", "user_id", "trail_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)