app/controllers/countries_controller.rb

  def index
    @countries = Country.all.order('name ASC')
---
SELECT "countries".* FROM "countries" ORDER BY name ASC

  def show
    @country = Country.find(params[:id])
    if @country.trails.empty?
---
SELECT  "countries".* FROM "countries" WHERE "countries"."id" = ? LIMIT ?  [["id", 210], ["LIMIT", 1]]
SELECT "trails".* FROM "trails" WHERE "trails"."country_id" = ?  [["country_id", 210]]
SELECT  "countries".* FROM "countries" WHERE "countries"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
SELECT  1 AS one FROM "trails" WHERE "trails"."country_id" = ? LIMIT ?  [["country_id", 6], ["LIMIT", 1]]