app/controllers/home_controller.rb

  def index
    @trails = Trail.all
---
SELECT "trails".* FROM "trails" ORDER BY created_at asc