app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "bob@101.com"], ["LIMIT", 1]]
---
  def create
    if @user = User.find_by(email: params[:user][:email])