app/controllers/trails_controller.rb

  def trails_by_time
    list = Trail.search(params[:search]).order("created_at DESC")
    if !list.empty?
---
SELECT "trails".* FROM "trails" WHERE (duration LIKE '2' ) ORDER BY created_at DESC, created_at asc
SELECT  1 AS one FROM "trails" WHERE (duration LIKE '2' ) LIMIT ?  [["LIMIT", 1]]

  def trails_by_distance
    list = Trail.search2(params[:search]).order("created_at DESC")
    if !list.empty?
---
SELECT "trails".* FROM "trails" WHERE (distance LIKE '5' ) ORDER BY created_at DESC, created_at asc
SELECT  1 AS one FROM "trails" WHERE (distance LIKE '5' ) LIMIT ?  [["LIMIT", 1]]

  def trails_by_difficulty
    list = Trail.search3(params[:search]).order("created_at DESC")
    if !list.empty?
---
SELECT "trails".* FROM "trails" WHERE (difficulty LIKE '4' ) ORDER BY created_at DESC, created_at asc
SELECT  1 AS one FROM "trails" WHERE (difficulty LIKE '4' ) LIMIT ?  [["LIMIT", 1]]

  def set_trail
    @trail = Trail.find(params[:id])
---
SELECT  "trails".* FROM "trails" WHERE "trails"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]